#include <iostream>
#include <conio.h>
#include <Windows.h>
using namespace std;


//Написати програму обчислення об’єму паралелепіпеда.Нижче наведено рекомендований вигляд
//екрану під час виконання програми.
//Обчислення відстані між населеними пунктами.
//Введіть вихідні дані :
//Масштаб карти(кількість кілометрів
//	в одному сантиметрі) -> 120
//	Відстань між точками, які зображують
//	населені пункти(см) -> 3.5
//	Відстань між населеними пунктами 420 км.


int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	
	double scale, distance, result;

	cout << "Обчислення відстані між населеними пунктами. \nВведіть вихідні дані: \n\tМасштаб карти (кількість кілометрів в одному сантиметрі) -> ";
	cin >> scale;
	cout << "\n\tВідстань між точками, які зображують населені пункти(см) -> ";
	cin >> distance;
	result = scale * distance;
	cout << "\n\tВідстань між населеними пунктами " << result << " км.";

	_getch;
	return 0;
}